# NotEnoughPointsInSurface Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..NotEnoughPointsInSurface Property
BuiltInFailures..::..SiteFailures Class See Also
---
The surface must have at least three distinct Points.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotEnoughPointsInSurface { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotEnoughPointsInSurface As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotEnoughPointsInSurface {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace